
## :x: Apply Failed

[CI link](https://github.com/ikigaikintore/ikigaikintore/actions/runs/8344533318)



<pre><code>Error: Error creating Secret: googleapi: Error 409: Secret [projects/139527520332/secrets/proxy_telegram_bot_token] already exists.

  with google_secret_manager_secret.telegram-sa-secret[&#34;proxy_telegram_bot_token&#34;],
  on telegram.tf line 27, in resource &#34;google_secret_manager_secret&#34; &#34;telegram-sa-secret&#34;:
  27: resource &#34;google_secret_manager_secret&#34; &#34;telegram-sa-secret&#34; {


Error: Error creating Secret: googleapi: Error 409: Secret [projects/139527520332/secrets/proxy_telegram_webhook_user_id] already exists.

  with google_secret_manager_secret.telegram-sa-secret[&#34;proxy_telegram_webhook_user_id&#34;],
  on telegram.tf line 27, in resource &#34;google_secret_manager_secret&#34; &#34;telegram-sa-secret&#34;:
  27: resource &#34;google_secret_manager_secret&#34; &#34;telegram-sa-secret&#34; {

::error::Terraform exited with code 1.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
google_service_account.proxy-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/proxy-sa@gig-japan-398904.iam.gserviceaccount.com]
google_service_account.gitops-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_service.backend-api-resources["secretmanager.googleapis.com"]: Refreshing state... [id=gig-japan-398904/secretmanager.googleapis.com]
google_project_service.backend-api-resources["run.googleapis.com"]: Refreshing state... [id=gig-japan-398904/run.googleapis.com]
google_secret_manager_secret.proxy-sa-secret["proxy_telegram_webhook_url"]: Refreshing state... [id=projects/gig-japan-398904/secrets/proxy_telegram_webhook_url]
google_secret_manager_secret.proxy-sa-secret["proxy_telegram_bot_token"]: Refreshing state... [id=projects/gig-japan-398904/secrets/proxy_telegram_bot_token]
google_iam_workload_identity_pool.gitops-github-identity-pool: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github]
google_secret_manager_secret.proxy-sa-secret["proxy_allowed_domains"]: Refreshing state... [id=projects/gig-japan-398904/secrets/proxy_allowed_domains]
google_secret_manager_secret.proxy-sa-secret["proxy_telegram_webhook_user_id"]: Refreshing state... [id=projects/gig-japan-398904/secrets/proxy_telegram_webhook_user_id]
google_secret_manager_secret.proxy-sa-secret["proxy_target_backend"]: Refreshing state... [id=projects/gig-japan-398904/secrets/proxy_target_backend]
google_secret_manager_secret.proxy-sa-secret["proxy_telegram_webhook_path_base"]: Refreshing state... [id=projects/gig-japan-398904/secrets/proxy_telegram_webhook_path_base]
google_service_account.backend-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_service_account.frontend-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/frontend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_artifact_registry_repository.artifact-repository: Refreshing state... [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]
google_project_service.frontend-api-resources["firestore.googleapis.com"]: Refreshing state... [id=gig-japan-398904/firestore.googleapis.com]
google_project_service.frontend-api-resources["identitytoolkit.googleapis.com"]: Refreshing state... [id=gig-japan-398904/identitytoolkit.googleapis.com]
google_project_service.frontend-api-resources["serviceusage.googleapis.com"]: Refreshing state... [id=gig-japan-398904/serviceusage.googleapis.com]
google_project_service.api-resources["artifactregistry.googleapis.com"]: Refreshing state... [id=gig-japan-398904/artifactregistry.googleapis.com]
google_project_iam_member.gitops-sa-roles["roles/run.admin"]: Refreshing state... [id=gig-japan-398904/roles/run.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-roles["roles/secretmanager.admin"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-roles["roles/storage.admin"]: Refreshing state... [id=gig-japan-398904/roles/storage.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-roles["roles/artifactregistry.admin"]: Refreshing state... [id=gig-japan-398904/roles/artifactregistry.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-roles["roles/editor"]: Refreshing state... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-roles["roles/iam.serviceAccountUser"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountUser/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-roles["roles/iam.workloadIdentityUser"]: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_iam_workload_identity_pool_provider.gitops-github-pool-provider: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github/providers/gitops-github-pool]
google_project_iam_member.gitops-sa-binding: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/139527520332/locations/global/workloadIdentityPools/gitops-github/subject/ikigaikintore/ikigaikintore]
google_project_iam_member.proxy-sa-roles["roles/run.invoker"]: Refreshing state... [id=gig-japan-398904/roles/run.invoker/serviceAccount:proxy-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.proxy-sa-roles["roles/secretmanager.secretAccessor"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.secretAccessor/serviceAccount:proxy-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.backend-sa-roles["roles/secretmanager.secretAccessor"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.secretAccessor/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.backend-sa-roles["roles/artifactregistry.reader"]: Refreshing state... [id=gig-japan-398904/roles/artifactregistry.reader/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.backend-sa-roles["roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountTokenCreator/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.backend-sa-roles["roles/iam.serviceAccountUser"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountUser/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.backend-sa-roles["roles/logging.viewer"]: Refreshing state... [id=gig-japan-398904/roles/logging.viewer/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.backend-sa-roles["roles/monitoring.viewer"]: Refreshing state... [id=gig-japan-398904/roles/monitoring.viewer/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.backend-sa-roles["roles/run.developer"]: Refreshing state... [id=gig-japan-398904/roles/run.developer/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.frontend-sa-roles["roles/iam.serviceAccountUser"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountUser/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.frontend-sa-roles["roles/secretmanager.secretAccessor"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.secretAccessor/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.frontend-sa-roles["roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountTokenCreator/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.frontend-sa-roles["roles/run.developer"]: Refreshing state... [id=gig-japan-398904/roles/run.developer/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_secret_manager_secret.backend-sa-secret["weather_api_key"]: Refreshing state... [id=projects/gig-japan-398904/secrets/weather_api_key]
google_secret_manager_secret.frontend-secrets["firebase_auth_domain"]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_auth_domain]
google_secret_manager_secret.frontend-secrets["firebase_api_key"]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_api_key]
google_secret_manager_secret.frontend-secrets["firebase_project_id"]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_project_id]
google_secret_manager_secret.frontend-secrets["firebase_storage_bucket"]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_storage_bucket]
google_secret_manager_secret.frontend-secrets["user_auth"]: Refreshing state... [id=projects/gig-japan-398904/secrets/user_auth]
google_secret_manager_secret.frontend-secrets["base_endpoint"]: Refreshing state... [id=projects/gig-japan-398904/secrets/base_endpoint]
google_secret_manager_secret.frontend-secrets["firebase_messaging_sender_id"]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_messaging_sender_id]
google_secret_manager_secret.frontend-secrets["environment"]: Refreshing state... [id=projects/gig-japan-398904/secrets/environment]
google_secret_manager_secret.frontend-secrets["firebase_app_id"]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_app_id]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_project_iam_member.telegram-sa-roles["roles/run.invoker"] will be created
  + resource "google_project_iam_member" "telegram-sa-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "gig-japan-398904"
      + role    = "roles/run.invoker"
    }

  # google_project_iam_member.telegram-sa-roles["roles/secretmanager.secretAccessor"] will be created
  + resource "google_project_iam_member" "telegram-sa-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "gig-japan-398904"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # google_secret_manager_secret.frontend-secrets["environment"] will be destroyed
  # (because key ["environment"] is not in for_each map)
  - resource "google_secret_manager_secret" "frontend-secrets" {
      - annotations           = {} -> null
      - create_time           = "2024-02-16T13:51:09.281479Z" -> null
      - effective_annotations = {} -> null
      - effective_labels      = {} -> null
      - id                    = "projects/gig-japan-398904/secrets/environment" -> null
      - labels                = {} -> null
      - name                  = "projects/139527520332/secrets/environment" -> null
      - project               = "gig-japan-398904" -> null
      - secret_id             = "environment" -> null
      - terraform_labels      = {} -> null
      - version_aliases       = {} -> null

      - replication {
          - auto {
            }
        }
    }

  # google_secret_manager_secret.proxy-sa-secret["proxy_target_backend"] will be destroyed
  # (because key ["proxy_target_backend"] is not in for_each map)
  - resource "google_secret_manager_secret" "proxy-sa-secret" {
      - annotations           = {} -> null
      - create_time           = "2024-03-08T00:07:53.652484Z" -> null
      - effective_annotations = {} -> null
      - effective_labels      = {} -> null
      - id                    = "projects/gig-japan-398904/secrets/proxy_target_backend" -> null
      - labels                = {} -> null
      - name                  = "projects/139527520332/secrets/proxy_target_backend" -> null
      - project               = "gig-japan-398904" -> null
      - secret_id             = "proxy_target_backend" -> null
      - terraform_labels      = {} -> null
      - version_aliases       = {} -> null

      - replication {
          - auto {
            }
        }
    }

  # google_secret_manager_secret.proxy-sa-secret["proxy_telegram_bot_token"] will be destroyed
  # (because key ["proxy_telegram_bot_token"] is not in for_each map)
  - resource "google_secret_manager_secret" "proxy-sa-secret" {
      - annotations           = {} -> null
      - create_time           = "2024-03-17T14:06:12.334819Z" -> null
      - effective_annotations = {} -> null
      - effective_labels      = {} -> null
      - id                    = "projects/gig-japan-398904/secrets/proxy_telegram_bot_token" -> null
      - labels                = {} -> null
      - name                  = "projects/139527520332/secrets/proxy_telegram_bot_token" -> null
      - project               = "gig-japan-398904" -> null
      - secret_id             = "proxy_telegram_bot_token" -> null
      - terraform_labels      = {} -> null
      - version_aliases       = {} -> null

      - replication {
          - auto {
            }
        }
    }

  # google_secret_manager_secret.proxy-sa-secret["proxy_telegram_webhook_path_base"] will be destroyed
  # (because key ["proxy_telegram_webhook_path_base"] is not in for_each map)
  - resource "google_secret_manager_secret" "proxy-sa-secret" {
      - annotations           = {} -> null
      - create_time           = "2024-03-18T02:43:36.937017Z" -> null
      - effective_annotations = {} -> null
      - effective_labels      = {} -> null
      - id                    = "projects/gig-japan-398904/secrets/proxy_telegram_webhook_path_base" -> null
      - labels                = {} -> null
      - name                  = "projects/139527520332/secrets/proxy_telegram_webhook_path_base" -> null
      - project               = "gig-japan-398904" -> null
      - secret_id             = "proxy_telegram_webhook_path_base" -> null
      - terraform_labels      = {} -> null
      - version_aliases       = {} -> null

      - replication {
          - auto {
            }
        }
    }

  # google_secret_manager_secret.proxy-sa-secret["proxy_telegram_webhook_url"] will be destroyed
  # (because key ["proxy_telegram_webhook_url"] is not in for_each map)
  - resource "google_secret_manager_secret" "proxy-sa-secret" {
      - annotations           = {} -> null
      - create_time           = "2024-03-17T23:14:27.130244Z" -> null
      - effective_annotations = {} -> null
      - effective_labels      = {} -> null
      - id                    = "projects/gig-japan-398904/secrets/proxy_telegram_webhook_url" -> null
      - labels                = {} -> null
      - name                  = "projects/139527520332/secrets/proxy_telegram_webhook_url" -> null
      - project               = "gig-japan-398904" -> null
      - secret_id             = "proxy_telegram_webhook_url" -> null
      - terraform_labels      = {} -> null
      - version_aliases       = {} -> null

      - replication {
          - auto {
            }
        }
    }

  # google_secret_manager_secret.proxy-sa-secret["proxy_telegram_webhook_user_id"] will be destroyed
  # (because key ["proxy_telegram_webhook_user_id"] is not in for_each map)
  - resource "google_secret_manager_secret" "proxy-sa-secret" {
      - annotations           = {} -> null
      - create_time           = "2024-03-18T02:43:36.932595Z" -> null
      - effective_annotations = {} -> null
      - effective_labels      = {} -> null
      - id                    = "projects/gig-japan-398904/secrets/proxy_telegram_webhook_user_id" -> null
      - labels                = {} -> null
      - name                  = "projects/139527520332/secrets/proxy_telegram_webhook_user_id" -> null
      - project               = "gig-japan-398904" -> null
      - secret_id             = "proxy_telegram_webhook_user_id" -> null
      - terraform_labels      = {} -> null
      - version_aliases       = {} -> null

      - replication {
          - auto {
            }
        }
    }

  # google_secret_manager_secret.telegram-sa-secret["proxy_telegram_allowed_domains"] will be created
  + resource "google_secret_manager_secret" "telegram-sa-secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "proxy_telegram_allowed_domains"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.telegram-sa-secret["proxy_telegram_bot_token"] will be created
  + resource "google_secret_manager_secret" "telegram-sa-secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "proxy_telegram_bot_token"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.telegram-sa-secret["proxy_telegram_webhook_user_id"] will be created
  + resource "google_secret_manager_secret" "telegram-sa-secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "proxy_telegram_webhook_user_id"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # google_service_account.telegram-sa will be created
  + resource "google_service_account" "telegram-sa" {
      + account_id   = "telegram-sa"
      + disabled     = false
      + display_name = "telegram-sa"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "gig-japan-398904"
      + unique_id    = (known after apply)
    }

Plan: 6 to add, 0 to change, 6 to destroy.
google_secret_manager_secret.proxy-sa-secret["proxy_telegram_webhook_user_id"]: Destroying... [id=projects/gig-japan-398904/secrets/proxy_telegram_webhook_user_id]
google_secret_manager_secret.proxy-sa-secret["proxy_telegram_bot_token"]: Destroying... [id=projects/gig-japan-398904/secrets/proxy_telegram_bot_token]
google_secret_manager_secret.frontend-secrets["environment"]: Destroying... [id=projects/gig-japan-398904/secrets/environment]
google_secret_manager_secret.proxy-sa-secret["proxy_telegram_webhook_path_base"]: Destroying... [id=projects/gig-japan-398904/secrets/proxy_telegram_webhook_path_base]
google_secret_manager_secret.proxy-sa-secret["proxy_telegram_webhook_url"]: Destroying... [id=projects/gig-japan-398904/secrets/proxy_telegram_webhook_url]
google_secret_manager_secret.proxy-sa-secret["proxy_target_backend"]: Destroying... [id=projects/gig-japan-398904/secrets/proxy_target_backend]
google_secret_manager_secret.telegram-sa-secret["proxy_telegram_allowed_domains"]: Creating...
google_service_account.telegram-sa: Creating...
google_secret_manager_secret.telegram-sa-secret["proxy_telegram_webhook_user_id"]: Creating...
google_secret_manager_secret.telegram-sa-secret["proxy_telegram_bot_token"]: Creating...
google_secret_manager_secret.telegram-sa-secret["proxy_telegram_allowed_domains"]: Creation complete after 1s [id=projects/gig-japan-398904/secrets/proxy_telegram_allowed_domains]
google_secret_manager_secret.proxy-sa-secret["proxy_telegram_webhook_user_id"]: Destruction complete after 1s
google_secret_manager_secret.proxy-sa-secret["proxy_telegram_webhook_url"]: Destruction complete after 1s
google_secret_manager_secret.frontend-secrets["environment"]: Destruction complete after 1s
google_secret_manager_secret.proxy-sa-secret["proxy_telegram_webhook_path_base"]: Destruction complete after 1s
google_secret_manager_secret.proxy-sa-secret["proxy_target_backend"]: Destruction complete after 1s
google_secret_manager_secret.proxy-sa-secret["proxy_telegram_bot_token"]: Destruction complete after 2s
google_service_account.telegram-sa: Creation complete after 2s [id=projects/gig-japan-398904/serviceAccounts/telegram-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.telegram-sa-roles["roles/secretmanager.secretAccessor"]: Creating...
google_project_iam_member.telegram-sa-roles["roles/run.invoker"]: Creating...
google_project_iam_member.telegram-sa-roles["roles/secretmanager.secretAccessor"]: Creation complete after 7s [id=gig-japan-398904/roles/secretmanager.secretAccessor/serviceAccount:telegram-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.telegram-sa-roles["roles/run.invoker"]: Creation complete after 7s [id=gig-japan-398904/roles/run.invoker/serviceAccount:telegram-sa@gig-japan-398904.iam.gserviceaccount.com]

Error: Error creating Secret: googleapi: Error 409: Secret [projects/139527520332/secrets/proxy_telegram_bot_token] already exists.

  with google_secret_manager_secret.telegram-sa-secret["proxy_telegram_bot_token"],
  on telegram.tf line 27, in resource "google_secret_manager_secret" "telegram-sa-secret":
  27: resource "google_secret_manager_secret" "telegram-sa-secret" {


Error: Error creating Secret: googleapi: Error 409: Secret [projects/139527520332/secrets/proxy_telegram_webhook_user_id] already exists.

  with google_secret_manager_secret.telegram-sa-secret["proxy_telegram_webhook_user_id"],
  on telegram.tf line 27, in resource "google_secret_manager_secret" "telegram-sa-secret":
  27: resource "google_secret_manager_secret" "telegram-sa-secret" {

::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform_apply","PRNumber":183,"Program":"tfcmt","SHA1":"dae8233a0af5b26ec9a41ae12e4a89015f0e64ea","Vars":{},"WorkflowName":"iaac_apply"} -->